#pragma once
//===============================================================================
//
// コンティニュー処理 [continu.h]
// Author : 箱﨑彩花
//
//===============================================================================
#ifndef CONTINU_H_
#define _CONTINU_H_

//===============================================================================
//コンティニューの状態の種類
//===============================================================================
typedef enum
{
	CONTUNUESTATE_SELECT = 0,
	CONTINUESTATE_NONE,
	CONTINUESTATE_MAX,
} CONTINUESTATE;

//===============================================================================
//プロトタイプ宣言
//===============================================================================
void InitContinu(void);			//ポーズ初期化処理
void UninitContinu(void);		//ポーズ終了処理
void UpdateContinu(void);		//ポーズ更新処理
void DrawContinu(void);		//ポーズ描画処理

void SetContinue(CONTINUESTATE state);
#endif