//===============================================================================
//
// ポーズ処理 [pause.h]
// Author : 箱﨑彩花
//
//===============================================================================
#ifndef PAUSEMENU_H_
#define _PAUSEMENU_H_

//===============================================================================
//ポーズの状態の種類
//===============================================================================
typedef enum
{
	PAUSESTATE_CONTINU = 0,
	PAUSESTATE_RETRY,
	PAUSESTATE_QUIT,
	PAUSESTATE_NONE,
	PAUSESTATE_MAX,
} PAUSEATATE;

//===============================================================================
//プロトタイプ宣言
//===============================================================================
void InitPause(void);			//ポーズ初期化処理
void UninitPause(void);		//ポーズ終了処理
void UpdatePause(void);		//ポーズ更新処理
void DrawPause(void);		//ポーズ描画処理

#endif
