#pragma once
//===============================================================================
//
// リトライ処理 [retry.h]
// Author : 箱﨑彩花
//
//===============================================================================
#ifndef RETRY_H_
#define _RETRY_H_

//===============================================================================
//リトライの状態の種類
//===============================================================================
typedef enum
{
	RETRYSTATE_SELECT = 0,
	RETRYSTATE_NONE,
	RETRYSTATE_MAX,
} RETRYSTATE;

//===============================================================================
//プロトタイプ宣言
//===============================================================================
void InitRetry(void);			//ポーズ初期化処理
void UninitRetry(void);		//ポーズ終了処理
void UpdateRetry(void);		//ポーズ更新処理
void DrawRetry(void);		//ポーズ描画処理

void SetRetry(RETRYSTATE state);
#endif