//=============================================================================
//
// メイン処理 [main.h]
// Author : 箱﨑彩花
//
//=============================================================================
#ifndef _MAIN_H_		//二重インクルード防止
#define _MAIN_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include <windows.h>									//WindoesApplcation
#include <Xinput.h>										//ジョイコン使う時に使用
#include "d3dx9.h"											//描画処理に必要
#define DIRECTINPUT_VERSION (0x0800)	//ビルド時の警告対処用のマクロ
#include "dinput.h"											//入力処理に必要
#include "xaudio2.h"										//サウンド処理で必要

//*****************************************************************************
// ライブラリファイルのリンク
//*****************************************************************************
#pragma comment (lib,"d3d9.lib")		//描画処理に必要
#pragma comment(lib,"d3dx9.lib")		//[d3dx9.lib]の拡張ライブラリ
#pragma comment(lib,"dxguid.lib")	//DirectXコンポーネント（部品）使用に必要
#pragma comment(lib,"winmm.lib")	//システム時刻取得に必要
#pragma comment(lib,"dinput8.lib")	//入力処理に必要
#pragma comment (lib, "xinput.lib")	//ジョイコン必要

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SCREEN_WIDTH	(1280)																								// ウインドウの幅
#define SCREEN_HEIGHT	(720)																								// ウインドウの高さ
#define FVF_VERTEX_2D	(D3DFVF_XYZRHW | D3DFVF_DIFFUSE | D3DFVF_TEX1)			//頂点フォーマット
#define MAX_VERTEX		(4)																									//頂点数

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CRenderer;					//レンダリング
class CScene;						//シーン

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;		//頂点座標
	float rhw;							//1.0fで固定
	D3DCOLOR col;				//頂点カラー
	D3DXVECTOR2 tex;		//テクスチャ座標
} VERTEX_2D;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
int GetFPS(void);
//CScene ** GetScene(void);				//オブジェクトクラスの取得

#endif