//=============================================================================
//
// ランキング処理 [ranking.h]
// Author : 箱﨑彩花
//
//=============================================================================
#ifndef _RANKING_H_		//二重インクルード防止
#define _RANKING_H_

#include	"main.h"				//メイン

//*****************************************************************************
// ランキングクラス
//*****************************************************************************
class CRanking
{
public:
	CRanking();																	//コンストラクタ
	~CRanking();																//デストラクタ
	HRESULT Init(void);													//初期化処理
	void Uninit(void);															//終了処理
	void Update(void);														//更新処理
	void Draw(void);															//描画処理

private:
	static int m_nCntTime;												//ランキング画面からタイトル画面に移行する時に使用
};
#endif