//=============================================================================
//
// リザルトの処理 [result.h]
// Author : 箱﨑彩花
//
//=============================================================================
#ifndef _RESULT_H_		//二重インクルード防止
#define _RESULT_H_

#include	"main.h"			//メイン

//*****************************************************************************
// プレイヤークラス
//*****************************************************************************
class CResult
{
public:
	CResult();																	//コンストラクタ
	~CResult();																	//デストラクタ
	HRESULT Init(void);													//初期化処理
	void Uninit(void);															//終了処理
	void Update(void);														//更新処理
	void Draw(void);															//描画処理
};
#endif