//=============================================================================
//
// タイトルの処理 [title.h]
// Author : 箱﨑彩花
//
//=============================================================================
#ifndef _TITLE_H_		//二重インクルード防止
#define _TITLE_H_

#include	"main.h"		//メイン

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CSound;			//サウンド

//*****************************************************************************
// タイトルクラス
//*****************************************************************************
class CTitle
{
public:
	CTitle();																					//コンストラクタ
	~CTitle();																					//デストラクタ
	HRESULT Init(void);																//初期化処理
	void Uninit(void);																		//終了処理
	void Update(void);																	//更新処理
	void Draw(void);																		//描画処理

private:
	static int m_nCntTime;															//タイトルからランキング画面へ移行する時に使用
};
#endif