//=============================================================================
//
// 敵処理 [enemy.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _ENEMY_H_
#define _ENEMY_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define	MAX_ENEMY	(128)	// 敵の最大数

//*****************************************************************************
// 状態の設定
//*****************************************************************************
typedef enum
{//列挙型
	ENEMYSTATE_NOMAL = 0, //通常状態（1）
	ENEMYSTATE_DAMAGE,	  //ダメージ状態（2）
	ENEMYSTATE_MAX		  //敵の状態の総数（4）

}ENEMYSTATE;

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;	//位置
	D3DXVECTOR3 move;	//移動
	ENEMYSTATE state;	//状態
	int CntMove;		//移動量
	int nDirectionMove;
	int nPatternAnim;
	int nCntAnim;
	bool bUse;			//使用しているかどうか
}Enemy;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);

void SetEnemy(D3DXVECTOR3 pos);
Enemy *GetEnemy(void);
#endif
