//=============================================================================
//
// DirectX雛型処理 [main.h]
// Author : 佐藤安純　Sato_Asumi
//
//=============================================================================
#ifndef _GAME_H_
#define _GAME_H_

//=============================================================================
// インクルードファイル
//=============================================================================
#include "main.h"

//=============================================================================
// ゲームの状態
//=============================================================================
typedef enum
{
	GAMESTATE_NONE = 0,
	GAMESTATE_NORMAL,
	GAMESTATE_END_CLIA,
	GAMESTATE_END_OVER,
	GAMESTATE_MAX
}GAMESTATE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitGame(void);
void UninitGame(void);
void UpdateGame(void);
void DrawGame(void);

void SetGameState(GAMESTATE state);
GAMESTATE GetGameState(void);

void SetPause(bool bPause);
#endif