//=============================================================================
//
// 敵処理 [life.h]
// Author : 佐藤安純　Sato_Asumi
//
//=============================================================================
#ifndef _LIFE_H_
#define _LIFE_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitLife(void);
void UninitLife(void);
void UpdateLife(void);
void DrawLife(void);

void SetLife(int nLifeDown);

#endif