//=============================================================================
//
// ポーズ半透明処理 [pousefade.h]
// Author : 佐藤安純　Sato_Aumi
//
//=============================================================================
#ifndef _PAUSEFADE_H_
#define _PAUSEFADE_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitPauseFade(void);
void UninitPauseFade(void);
void UpdatePauseFade(void);
void DrawPauseFade(void);

#endif
