//=============================================================================
//
// ポーズ処理 [pouse.h]
// Author : 佐藤安純　Sato_Aumi
//
//=============================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_

#include "main.h"

//=============================================================================
// ポーズの状態の種類
//=============================================================================
typedef enum
{
	PAUSESTATE_CONTINUE = 0,
	PAUSESTATE_RETRY,
	PAUSESTATE_QUIT,
	PAUSESTATE_NONE,
	PAUSESTATE_MAX,
}PAUSESTATE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitPause(void);
void UninitPause(void);
void UpdatePause(void);
void DrawPause(void);
#endif