//=============================================================================
//
// ランキング画面 [rank.cpp]
// Author : 佐藤安純　Sato_Asumi
//
//=============================================================================
#include "rank.h"
#include "main.h"
#include "sound.h"
#include "input.h"
#include "fade.h"
#include "game.h"
#include "BG.h"
#include "start.h"
#include "ranking.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// グローバル変数
//=============================================================================
int g_nCntTimeRank;											//ゲーム画面切り替えカウンター

//=============================================================================
// 初期化処理
//=============================================================================
void InitRank(void)
{
	//変数呼び出し
	InitStart();		//エンターキー
	InitHighScore();	//ランキング		

	//背景のセット
	SetBG(5);

	//エンターキー
	SetEnter(D3DXVECTOR3(190.0f, 695.0f, 0.0f), D3DXCOLOR(0.0f, 0.0f, 0.0f, 1.0f));
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitRank(void)
{
	UninitStart();		//エンターキー
	UninitHighScore();	//ランキング
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateRank(void)
{
	g_nCntTimeRank++;

	//フェード情報を取得する
	FADE g_fade;
	g_fade = GetFade();

	//決定キーが押されたかどうか
	if (GetKeyboardTrigger(DIK_RETURN) == true)
	{
		if (g_fade != FADE_OUT)		//フェードアウトが実行されていないなら
		{
			//サウンド再生
			PlaySound(SOUND_LABEL_SE_ENTER);

			//エンターキーの状態変更
			SetPush(STARTSTRACT_ENTER);

			//フェードモード設定
			SetFade(MODE_TITLE);
		}
	}
	if (g_nCntTimeRank == INTERVAL_TIME)
	{
		//フェードモード設定
		SetFade(MODE_TITLE);
	}

	UpdateStart();		//エンターキー
	UpdateHighScore();	//ハイスコア
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawRank(void)
{
	DrawStart();		//エンターキー
	DrawHighScore();	//ランキング
}