//=============================================================================
//
// 背景処理 [bg.h]
// Author :Gokan akane
//
//=============================================================================
#ifndef _STARBG_H_ //二十インクルード防止のマクロ定義
#define _STARBG_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitStarBG(void);
void UninitStarBG(void);
void UpdateStarBG(void);
void DrawStarBG(void);
#endif
