//=============================================================================
//
// チュートリアル画面 [tutorial.cpp]
// Author : 佐藤安純　Sato_Asumi
//
//=============================================================================
#include "tutorial.h"
#include "main.h"
#include "input.h"
#include "fade.h"
#include "sound.h"
#include "start.h"
#include "BG.h"

//=============================================================================
// マクロ定義
//=============================================================================

//=============================================================================
// グローバル変数
//=============================================================================
int	g_nCntTimeTutorial;		//チュートリアルの時間カウンター

//=============================================================================
// タイトル初期化処理
//=============================================================================
void InitTutorial(void)
{
	//変数の初期化
	g_nCntTimeTutorial = 0;

	InitStart();		//エンターキー

	//背景のセット
	SetBG(4);

	//エンターキー
	SetEnter(D3DXVECTOR3(1100.0f, 25.0f, 0.0f), D3DXCOLOR(0.0f, 0.0f, 0.0f, 1.0f));
}

//=============================================================================
// タイトル終了処理
//=============================================================================
void UninitTutorial(void)
{
	UninitStart();			//エンターキー
}

//=============================================================================
// タイトル更新処理
//=============================================================================
void UpdateTutorial(void)
{
	//時間を加算する
	g_nCntTimeTutorial++;

	//フェード情報を取得する
	FADE g_fade;
	g_fade = GetFade();

	//決定キーが押されたかどうか
	if (GetKeyboardTrigger(DIK_RETURN) == true)
	{
		if (g_fade != FADE_OUT)		//フェードアウトが実行されていないなら
		{
			//エンターキーの状態の切り替え
			SetPush(STARTSTRACT_ENTER);

			//フェードモード設定
			SetFade(MODE_GAME);
			PlaySound(SOUND_LABEL_SE_ENTER);	//決定音
		}
	}
	if (g_nCntTimeTutorial == INTERVAL_TIME)
	{
		//フェードモード設定
		SetFade(MODE_TITLE);
	}

	UpdateStart();			//エンターキー
}

//=============================================================================
// タイトル描画処理
//=============================================================================
void DrawTutorial(void)
{
	//変数の呼び出し
	DrawStart();			//エンターキー
}