//=============================================================================
//
// タイトル処理 [tutorial.h]
// Author : 佐藤安純　Sato_Aumi
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTRIAL_H_

#include "main.h"

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitTutorial(void);
void UninitTutorial(void);
void UpdateTutorial(void);
void DrawTutorial(void);

#endif
