//=============================================================================
//
// 弾処理 [bullet.h]
// Author : 箱﨑彩花
//
//=============================================================================
#ifndef _BULLET_H_
#define _BULLET_H_

#include "main.h"

//=============================================================================
// 構造体の定義
//=============================================================================
typedef enum
{
	BULLETTYPE_PLAYER = 0,	//プレイヤーの弾
	BULLETTYPE_ENEMY,			//敵の弾
	BULLETTYPE_MAX
} BULLETTYPE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitBullet(void);
void UninitBullet(void);
void UpdateBullet(void);
void DrawBullet(void);
void SetBullet(D3DXVECTOR3 pos, D3DXVECTOR3 move, BULLETTYPE type);		//発射位置、移動量、種類

#endif