//=============================================================================
//
// ライフ処理 [life.h]
// Author : 箱﨑彩花
//
//=============================================================================
#ifndef _LIFE_H_
#define _LIFE_H_

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitLife(void);
void UninitLife(void);
void UpdateLife(void);
void DrawLife(void);

void SetLife(int nLifeDown);

#endif
