//===============================================================================
//
// ポーズメニュー処理 [pausemenu.h]
// Author : 箱﨑彩花
//
//===============================================================================
#ifndef PAUSEMENU_H_
#define _PAUSEMENU_H_

//===============================================================================
//ポーズメニューの状態の種類
//===============================================================================
typedef enum
{
	PAUSEMENUSTATE_SELECT = 0,
	PAUSEMENUSTATE_NONE,
	PAUSEMENUSTATE_MAX,
} PAUSEMENUSTATE;

//===============================================================================
//プロトタイプ宣言
//===============================================================================
void InitPauseMenu(void);			//ポーズメニュー初期化処理
void UninitPauseMenu(void);		//ポーズメニュー終了処理
void UpdatePauseMenu(void);		//ポーズメニュー更新処理
void DrawPauseMenu(void);		//ポーズメニュー描画処理

#endif