//===============================================================================
//
// クウィット処理 [quit.h]
// Author : 箱﨑彩花
//
//===============================================================================
#ifndef QUIT_H_
#define _QUIT_H_

//===============================================================================
//クウィットの状態の種類
//===============================================================================
typedef enum
{
	QUITSTATE_SELECT = 0,
	QUITSTATE_NONE,
	QUITSTATE_MAX,
} QUITSTATE;

//===============================================================================
//プロトタイプ宣言
//===============================================================================
void InitQuit(void);			//クウィット初期化処理
void UninitQuit(void);		//クウィット終了処理
void UpdateQuit(void);	//クウィット更新処理
void DrawQuit(void);		//クウィット描画処理

void SetQuit(QUITSTATE state);
#endif