//===============================================================================
//
// リザルト画面 [result.h]
// Author : 箱﨑彩花
//
//===============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//===============================================================================
//プロトタイプ宣言
//===============================================================================
void InitResult(void);			//リザルト画面初期化処理
void UninitResult(void);		//リザルト画面終了処理
void UpdateResult(void);	//リザルト画面更新処理
void DrawResult(void);		//リザルト画面描画処理

#endif