#pragma once
//===============================================================================
//
// タイトル画面 [title.h]
// Author : 箱﨑彩花
//
//===============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "main.h"

//===============================================================================
//プロトタイプ宣言
//===============================================================================
void InitTitle(void);			//タイトル画面初期化処理
void UninitTitle(void);		//タイトル画面終了処理
void UpdateTitle(void);	//タイトル画面更新処理
void DrawTitle(void);		//タイトル画面描画処理

#endif