//===============================================================================
//
// チュートリアル画面 [tutorial.h]
// Author : 箱﨑彩花
//
//===============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

//===============================================================================
//プロトタイプ宣言
//===============================================================================
void InitTutorial(void);			//チュートリアル画面初期化処理
void UninitTutorial(void);		//チュートリアル画面終了処理
void UpdateTutorial(void);	//チュートリアル画面更新処理
void DrawTutorial(void);		//チュートリアル画面描画処理

#endif