//=============================================================================
//
// カメラ処理 [camera.h]
// Author : 箱﨑彩花
//
//=============================================================================
#ifndef _CAMERA_H_
#define _CAMERA_H_

#include "main.h"

//*****************************************************************************
// カメラの構造体
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 posV;					//視点
	D3DXVECTOR3 posR;					//注視点
	D3DXVECTOR3 vecU;					//上方向ベクトル
	D3DXMATRIX mtxProjection;		//プロジェクションマトリックス
	D3DXMATRIX mtxView;				//ビューマトリックス
	D3DXVECTOR3 rot;						//向き
	float distance;								//距離
} Camera;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitCamera(void);				//カメラ初期化処理
void UninitCamera(void);		//カメラ終了処理
void UpdateCamera(void);		//カメラ更新処理
void SetCamera(void);				//カメラの設定
Camera * GetCamera(void);	//カメラの取得
#endif
