//=============================================================================
//
// エネミー処理 [	enemy.h]
// Author : 箱﨑彩花
//
//=============================================================================
#ifndef _ENEMY_H_
#define _ENEMY_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_ENEMY	(256)

//*****************************************************************************
// エネミーの構造体
//*****************************************************************************
typedef struct
{
	D3DXVECTOR3 pos;							//位置
	D3DXVECTOR3 rot;								//向き
	D3DXMATRIX mtxWorldEnemy;			//ワールドマトリックス
	int nIdxEnemyShadow;						//影が使われているかどうか
	int nTexType;										//テクスチャのタイプ
	int nCntAnim;										//カウンターアニメーション
	int nPatternAnim;								//パターンアニメーション
	bool bUse;											//ビルボードが使われているかどうか
} Enemy;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitEnemy(void);
void UninitEnemy(void);
void UpdateEnemy(void);
void DrawEnemy(void);
void SetEnemy(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int TexType);
void DeleteEnemy(int nCntEnemy);
Enemy *GetEnemy(void);
#endif