//=============================================================================
//
// タイムの処理 [time.h]
// Author : 箱﨑彩花
//
//=============================================================================
#ifndef _TIME_H_
#define _TIME_H_

#include "main.h"

//=============================================================================
// フェードの状態
//=============================================================================
typedef enum
{
	TIMESTATE_NONE = 0,			// 何もしていない状態
	TIMESTATE_NORMAL,			// 通常状態
	TIMESTATE_CLEAR,					// クリア状態
	TIMESTATE_OVER,					// オーバー状態
	TIMESTATE_MAX
} TIMESTATE;

//=============================================================================
// プロトタイプ宣言
//=============================================================================
void InitTime(void);
void UninitTime(void);
void UpdateTime(void);
void DrawTime(void);
void AddTime(void);
//void ResultTime(int nScore);
#endif